app/Views/Student/vocabulary_exam_result.php

SELECT *
FROM `vocabulary_quiz`
WHERE `voc_quiz_id` = '1'
---

        <?php $i=1; foreach (newSession()->voc_quiz_exam as $key => $qu){
            $quiztable = DB()->table('vocabulary_quiz');
            $quiz = $quiztable->where('voc_quiz_id',$qu['quizId'])->get()->getRow();