app/Views/Student/vocabulary.php

SELECT *
FROM `vocabulary_exam_joined`
WHERE `voc_exam_id` = '1'
AND `std_id` = '1'
---
                <?php
                    foreach ($vocabularyExam as $ex){
                    $table = DB()->table('vocabulary_exam_joined');
                    $data = $table->where('voc_exam_id',$ex->voc_exam_id)->where('std_id',newSession()->std_id)->get()->getRow();