app/Controllers/Admin/Student.php

    public function getAll()
    {
        $role = $this->session->admin_role;
        //[mod_access] [create] [read] [update] [delete]
        $perm = $this->permission->module_permission_list($role,$this->module_name);

        $response = array();

        $data['data'] = array();

        $result = $this->student->findAll();
---
SELECT *
FROM `student`

    public function view($id){
        $isLoggedIAdmin = $this->session->isLoggedIAdmin;
        if (!isset($isLoggedIAdmin) || $isLoggedIAdmin != TRUE) {
            return redirect()->to(site_url("/admin"));
        }else {
            $data['student'] = $this->student->where('std_id' ,$id)->first();
---
SELECT *
FROM `student`
WHERE `std_id` = '1'
 LIMIT 1

    public function test($id){
        $isLoggedIAdmin = $this->session->isLoggedIAdmin;
        if (!isset($isLoggedIAdmin) || $isLoggedIAdmin != TRUE) {
            return redirect()->to(site_url("/admin"));
        }else {
            $data['student'] = $this->student->where('std_id' ,$id)->first();
            $data['controller'] = 'Admin/Student';

            $data['chapExam'] = $this->chapter_exam_joinedModel->where('std_id',$id)->findAll();
            $data['mcqExam'] = $this->mcq_exam_joinedModel->where('std_id',$id)->findAll();
            $data['vocExam'] = $this->vocabulary_exam_joinedModel->where('std_id',$id)->findAll();
            $data['quizExam'] = $this->quiz_exam_joinedModel->where('std_id',$id)->findAll();
---
SELECT *
FROM `student`
WHERE `std_id` = '1'
 LIMIT 1
SELECT *
FROM `chapter_exam_joined`
WHERE `std_id` = '1'
SELECT *
FROM `mcq_exam_joined`
WHERE `std_id` = '1'
SELECT *
FROM `vocabulary_exam_joined`
WHERE `std_id` = '1'
SELECT *
FROM `quiz_exam_joined`
WHERE `std_id` = '1'