app/Controllers/Admin/Vocabulary_exam.php

SELECT *
FROM `vocabulary_exam`
---
    public function getAll()
    {
        $role = $this->session->admin_role;
        //[mod_access] [create] [read] [update] [delete]
        $perm = $this->permission->module_permission_list($role,$this->module_name);
        $response = array();

        $data['data'] = array();

        $result = $this->vocabulary_examModel->findAll();

UPDATE `vocabulary_exam` SET `voc_exam_id` = '1', `title` = 'Vocabulary first exam', `published_date` = '2022-07-27', `status` = 'Published'
WHERE `vocabulary_exam`.`voc_exam_id` IN ('1')
SELECT *
FROM `vocabulary_exam_r_quiz`
WHERE `voc_exam_id` = '1'
DELETE FROM `vocabulary_exam_r_quiz`
WHERE `exam_quiz_id` = '16'
---
    public function edit()
    {

        $response = array();

        $voc_exam_id = $this->request->getPost('voc_exam_id');
        $quiz = $this->request->getPost('voc_quiz_id[]');
        $fields['voc_exam_id'] = $this->request->getPost('voc_exam_id');
        $fields['title'] = $this->request->getPost('title');
        $fields['published_date'] = $this->request->getPost('published_date');
        $fields['status'] = $this->request->getPost('status');

        $this->validation->setRules([
            'title' => ['label' => 'Title', 'rules' => 'required'],
            'published_date' => ['label' => 'Published date', 'rules' => 'required'],
            'status' => ['label' => 'Status', 'rules' => 'required'],
        ]);

        if ($this->validation->run($fields) == FALSE) {
            $response['success'] = false;
            $response['messages'] = $this->validation->listErrors();
        } else {
            if ($this->vocabulary_examModel->update($fields['voc_exam_id'], $fields)) {

                $quizData = $this->vocabulary_exam_r_quizModel->where('voc_exam_id', $voc_exam_id)->findAll();
                foreach ($quizData as $val) {
                    $this->vocabulary_exam_r_quizModel->where('exam_quiz_id', $val->exam_quiz_id)->delete();

INSERT INTO `vocabulary_exam_r_quiz` (`voc_exam_id`, `voc_quiz_id`, `createdBy`) VALUES ('1', '1', '1')
---

                foreach ($quiz as $q){
                    $quizind =['voc_exam_id'=> $voc_exam_id,'voc_quiz_id'=> $q,'createdBy' => $this->session->user_id, ];
                    $this->vocabulary_exam_r_quizModel->insert($quizind);