app/Helpers/Helpers_helper.php

SELECT *
FROM `product_category`
WHERE `product_category` = 'Man'
---
function get_category_link_by_name($name,$url){

    $table = DB()->table('product_category');
    $table->where('product_category', $name);
    $data = $table->get()->getRow();