app/Helpers/Helpers_helper.php

SELECT *
FROM `chapter_exam_joined`
WHERE `std_id` = '1'
AND `chapter_id` = '1'
---
function already_join_chapter_check($chapterId){
    $tabledta = DB()->table('chapter_exam_joined');
    $data = $tabledta->where('std_id',newSession()->std_id)->where('chapter_id',$chapterId)->get()->getRow();

SELECT *
FROM `vocabulary_exam_joined`
WHERE `std_id` = '1'
AND `voc_exam_id` = '3'
---
function already_join_voc_exam_check($voc_exam_id){
    $tabledta = DB()->table('vocabulary_exam_joined');
    $data = $tabledta->where('std_id',newSession()->std_id)->where('voc_exam_id',$voc_exam_id)->get()->getRow();