app/Controllers/Student/Dashboard.php

    public function index()
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {
            $data['footer_icon'] = 'Home';
            unset($_SESSION['quiz']);
            unset($_SESSION['result_submit']);
            $query = $this->student->where('std_id',$this->session->std_id)->get();
---
SELECT *
FROM `student`
WHERE `std_id` = '1'