app/Controllers/Student/Ranking.php

SELECT *
FROM `student`
SELECT MAX(`point`) AS `point`
FROM `student`
SELECT *
FROM `student`
WHERE `point` = '1050'
 LIMIT 1
---
    public function index()
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/');
            $data['page_title'] = 'Ranking';
            $data['footer_icon'] = 'Ranking';

            $data['student'] = $this->studentModel->findAll();

            $table = DB()->table('student');
            $hpoint = $table->selectMax('point' )->get()->getRow()->point;