app/Controllers/Student/Shopping.php

    public function index()
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/');
            $data['cart_url'] = base_url('/Student/Shopping/cart');
            $data['category_url'] = base_url('/Student/Shopping/category');
            $data['page_title'] = 'Shopping';
            $data['footer_icon'] = 'Shopping';

            $gen = get_data_by_id('gender', 'student', 'std_id', $this->session->std_id);
            $gender = ($gen == 'Male') ? 'Women' : 'Man';

            $data['product'] = $this->productModel->where('gender_type !=', $gender)->findAll();
---
SELECT *
FROM `products`
WHERE `gender_type` != 'Women'

    public function invoice($id){
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/Student/Shopping/order_list');
            $data['cart_url'] = base_url('/Student/Shopping/cart');
            $data['page_title'] = 'Invoice';
            $data['footer_icon'] = 'Shopping';

            $data['order'] = $this->orderModel->find($id);
            $data['orderItem'] = $this->orderItemModel->where('order_id',$id)->findAll();
---
SELECT *
FROM `order`
WHERE `order`.`order_id` = '1'
SELECT *
FROM `order_item`
WHERE `order_id` = '1'

    public function order_list(){
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/Student/Shopping/');
            $data['cart_url'] = base_url('/Student/Shopping/cart');
            $data['page_title'] = 'Order list';
            $data['footer_icon'] = 'Shopping';

            $data['order'] = $this->orderModel->findAll();
---
SELECT *
FROM `order`