app/Controllers/Student/Subject.php

SELECT *
FROM `subject`
WHERE `class_id` = '1'
---
    public function index()
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {
            $data['back_url'] = base_url('/');
            $data['page_title'] = 'My Subject';
            $data['footer_icon'] = 'Home';

            $classId = get_data_by_id('class_id','student','std_id',$this->session->std_id);

            $data['subject'] = $this->subjectModel->where('class_id',$classId)->findAll();

SELECT *
FROM `chapter`
WHERE `subject_id` = '4'
---
    public function chapter($subjectId)
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {
            $subject = get_data_by_id('name','subject','subject_id',$subjectId);
            $data['back_url'] = base_url('/Student/Subject');
            $data['page_title'] = $subject;
            $data['footer_icon'] = 'Home';


            $data['chapter'] = $this->chapterModel->where('subject_id',$subjectId)->findAll();