app/Controllers/Student/VideoQuiz.php

SELECT *
FROM `chapter_video`
WHERE `chapter_id` = '1'
 LIMIT 1
SELECT *
FROM `chapter_quiz`
WHERE `chapter_id` = '1'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `chapter_quiz`
WHERE `chapter_id` = '1'
---
    public function index($chapterId)
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $pager = \Config\Services::pager();
            $chapter = get_data_by_id('name','chapter','chapter_id',$chapterId);
            $subjectId = get_data_by_id('subject_id','chapter','chapter_id',$chapterId);
            $data['back_url'] = base_url('/Student/Subject/chapter/'.$subjectId);
            $data['page_title'] = $chapter;
            $data['footer_icon'] = 'Home';



            $data['video'] = $this->chapterVideoModel->where('chapter_id',$chapterId)->first();
            $data['quiz'] = $this->chapterQuizModel->where('chapter_id',$chapterId)->paginate(1);