app/Controllers/Student/Vocabulary.php

    public function index()
    {
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/');
            $data['page_title'] = 'Vocabulary';

            //session unset
            unset($_SESSION['voc_mcq_joined_id']);
            unset($_SESSION['voc_quiz_exam']);

            $vocLimit = get_data_by_id('value','settings','label','vocabulary_quiz_view_frontEnd');

            $data['vocabulary'] = $this->vocabularyModel->orderBy('voc_id', 'RANDOM')->findAll($vocLimit);
            $data['vocabularyExam'] = $this->vocabulary_examModel->where('status','Published')->where('published_date',date('Y-m-d'))->findAll();
---
SELECT *
FROM `vocabulary_exam`
WHERE `status` = 'Published'
AND `published_date` = '2022-07-27'

    public function exam_join($voc_exam_id){
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {

            $data['back_url'] = base_url('/Student/Vocabulary');
            $data['page_title'] = 'Vocabulary Quiz Exam';


            $check = already_join_voc_exam_check($voc_exam_id);
            if ($check == 0) {
                $joinData = array(
                    'voc_exam_id' => $voc_exam_id,
                    'std_id' => $this->session->std_id,
                    'createdBy' => $this->session->std_id,
                );
                $this->vocabulary_exam_joinedModel->insert($joinData);
                $insertId = $this->vocabulary_exam_joinedModel->getInsertID();
                $this->session->set('voc_mcq_joined_id',$insertId);
            }


            $data['quiz'] = $this->vocabulary_exam_r_quizModel->where('voc_exam_id',$voc_exam_id)->paginate(1);
---
SELECT *
FROM `vocabulary_exam_r_quiz`
WHERE `voc_exam_id` = '3'
 LIMIT 1, 1
SELECT COUNT(*) AS `numrows`
FROM `vocabulary_exam_r_quiz`
WHERE `voc_exam_id` = '3'

    public function result_view(){
        $isLoggedInStudent = $this->session->isLoggedInStudent;
        if (!isset($isLoggedInStudent) || $isLoggedInStudent != TRUE) {
            return redirect()->to('/login');
        } else {
            if (empty($this->session->voc_mcq_joined_id)){
                return redirect()->to('/Student/Vocabulary');
            }

            $data['back_url'] = base_url('/Student/Vocabulary');
            $data['page_title'] = 'Vocabulary Quiz Result';

            $data['result'] = $this->vocabulary_exam_joinedModel->where('voc_mcq_joined_id',$this->session->voc_mcq_joined_id)->first();
---
SELECT *
FROM `vocabulary_exam_joined`
WHERE `voc_mcq_joined_id` = 2
 LIMIT 1