app/Libraries/Permission.php

    public function module_permission_list($role_id, $module_name)
    {
        $table = DB()->table('roles');
        $result = $table->where('role_id',$role_id)->get()->getRow();
---
SELECT *
FROM `roles`
WHERE `role_id` = '1'